Documents/ra_ZayavkaNaOcenkuSootvetstviya2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ra_ZayavkaNaOcenkuSootvetstviya2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.del_ра_ОборотыПоказателейОтчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FormaOS</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_FormyOcenkiSootvetstviya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Proekt</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataRegistracii</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataZayavki</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegNomer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SkhemaSertifikacii</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_SkhemySertifikacii</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SkhemaSertifikaciiProdukcii</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_SkhemySertifikacii</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidZayavkiNaExpertizuTD</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_VidyZayavokNaExpertizuTD</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InformaciyaObObekteOcenkiSootvetstviya</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObektOcenkiSootvetstviyaObektAttestacionnyhIspytanij</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_ObektyAttestacionnyhIspytanij</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObektOcenkiSootvetstviyaProdukciya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_MTRiO</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObektOcenkiSootvetstviyaTekhnologicheskieSistemy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_TekhnologicheskieSistemy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObektOcenkiSootvetstviyaTekhDocs</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PerechenProdukciiPo277Prikazu</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_PerechenProdukciiPo277Prikazu</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PredlagaemayaZayavitelemSkhemaSertifikacii</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_SkhemySertifikacii</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GID_MTRIO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KKS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KodOKPD2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_OKPD2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KharakterProizvodstva</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_KharakterVypuskaProdukcii</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KlassBezopasnosti</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_KlassyBezopasnosti</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZavodskojNomer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataTU_TT</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidProdukciiPoGostu</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_VidyProdukciiPoGostu</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidProdukciiVSootvetstviiSNP_071_18</Name>
					<Type>
						<v8:Type>cfg:EnumRef.del_ra_VidyProdukciiVSootvetstviiSNP_071_18</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DogovorPostavki</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_Dogovory</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NomerPlanaKachestva</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EkspluatiruyushchayaOrganizaciya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Izgotovitel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Razrabotchik</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RukovoditelRazrabotchik</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ispolnitel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RukovoditelIspolnitel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Zayavitel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DolzhnostRukovoditelyaOrganizaciiZayavitelyaNaEkspertizuTD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DolzhnostUpolnomochennogoLicaOtZayavitelyaNaEkspretizuTD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RukovoditelOrganizaciiZayavitelyaNaEkspertizuTD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpolnomochennoeLicoOtZayavitelyaNaEkspertizuTD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ObektyOcenkiSootvetstviyaTD</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NaimenovanieObekta</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SeriynieNomera</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SerijnyjNomer</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ElementyObektaOcenkiSootvetstviya</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NaimenovanieObekta</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ra_RezultatyDejstvijPoZayavkeNaOS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ra_RezultatyDejstvijPoZayavkeNaOS</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Rezultat</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Zayavka</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ra_ZayavkaNaOcenkuSootvetstviya2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Dejstvie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ra_UvedomlenieObOtkazeVProvedeniiOS</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_ResheniePoZayavke</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_EkspertnoeZaklyuchenie</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_ProektEkspertnogoZaklyucheniya</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_UvedomlenieOProvedeniiOS</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_NaznachenieKomissii</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ra_FormyOcenkiSootvetstviya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ra_FormyOcenkiSootvetstviya</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AttestacionnyeIspytaniya</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EkspertizaTD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PoryadokObyazatelnojSertifikacii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InspekcionnyjKontrol</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Priemka</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReshenieOPrimeneniiImportnojProdukcii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Registraciya</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ra_ZayavkaNaOcenkuSootvetstviya2/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокДействия.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Объект.Ссылка);
	//СписокРезультаты.Параметры.УстановитьЗначениеПараметра("Заявка", Объект.Ссылка);
	ОбновитьРезультат();
	
	ИспользоватьФормуОценкиСоответствияБитрикс = Константы.ра_ИспользоватьФормуОценкиСоответствияБитрикс.Получить();
	
	УстановитьВидимостьДоступность(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура FormaOSПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура KodOKPD2ПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ObektOcenkiSootvetstviyaProdukciya) Тогда
		Объект.ObektOcenkiSootvetstviyaProdukciya = ПолучитьПродукциюПоКодуОКПД2(Объект.KodOKPD2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура KodOKPD3ПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ObektOcenkiSootvetstviyaProdukciya) Тогда
		Объект.ObektOcenkiSootvetstviyaProdukciya = ПолучитьПродукциюПоКодуОКПД2(Объект.KodOKPD2);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура СписокДействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокДействия.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьДействие(ТекущиеДанные.Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРезультатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокРезультаты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьДействие(ТекущиеДанные.Dejstvie);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДействие(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений; 

	СписокВыбора.Добавить("ra_ResheniePoZayavke", 					НСтр("ru = 'Решение по заявке'; en = 'Decision on the application'")); 
	СписокВыбора.Добавить("ra_UvedomlenieObOtkazeVProvedeniiOS", 	НСтр("ru = 'Уведомление об отказе в проведении ОС'; en = 'Notification of refusal to conduct the CA'")); 
	СписокВыбора.Добавить("ra_UvedomlenieOProvedeniiOS", 			НСтр("ru = 'Уведомление о проведении ОС'; en = 'Notification of CA'")); 
	СписокВыбора.Добавить("ra_NaznachenieKomissii", 				НСтр("ru = 'Назначение комиссии (Экспертной группы)'; en = 'Appointment of the Commission (Expert group)'")); 
	СписокВыбора.Добавить("ra_ProektEkspertnogoZaklyucheniya", 		НСтр("ru = 'Проект экспертного заключения'; en = 'Draft of the expert conclusion'")); 
	СписокВыбора.Добавить("ra_EkspertnoeZaklyuchenie", 				НСтр("ru = 'Экспертное заключение'; en = 'Expert opinion'")); 

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораДействия", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, СписокВыбора);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораДействия(ВыбранныйЭлемент, Параметры) Экспорт
    
	Если ВыбранныйЭлемент <> Неопределено Тогда 
		ПередаваемыеПараметры = Новый Структура("ДокументОснование",Объект.Ссылка);
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьСписокДействий", ЭтотОбъект);
		ОткрытьФорму("Документ." + ВыбранныйЭлемент.Значение + ".ФормаОбъекта", ПередаваемыеПараметры, ЭтаФорма, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДействий(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.СписокДействия.Обновить();
	Элементы.СписокРезультаты.Обновить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭкспертизаТД = Объект.FormaOS = ПредопределенноеЗначение("Перечисление.ra_FormyOcenkiSootvetstviya.EkspertizaTD");
	
	Если Форма.ИспользоватьФормуОценкиСоответствияБитрикс Тогда
		Элементы.Основное.Видимость = Ложь;
		Элементы.ОсновноеБитрикс.Видимость = Истина;
		Элементы.VidZayavkiNaExpertizuTD1.Видимость = ЭкспертизаТД;
	Иначе
		Элементы.DolzhnostRukovoditelyaOrganizaciiZayavitelyaNaEkspertizuTD.Видимость 	= ЭкспертизаТД;
		Элементы.DolzhnostUpolnomochennogoLicaOtZayavitelyaNaEkspretizuTD.Видимость 	= ЭкспертизаТД;
		Элементы.RukovoditelOrganizaciiZayavitelyaNaEkspertizuTD.Видимость 				= ЭкспертизаТД;
		Элементы.UpolnomochennoeLicoOtZayavitelyaNaEkspertizuTD.Видимость 				= ЭкспертизаТД;
		Элементы.VidZayavkiNaExpertizuTD.Видимость 										= ЭкспертизаТД;
		Элементы.ГруппаРазработчик.Видимость 											= ЭкспертизаТД;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяДокумента(Действие)
	
	Возврат Действие.Метаданные().Имя;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьДействие(Действие)
	
	ИмяДокумента = ПолучитьИмяДокумента(Действие);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьСписокДействий", ЭтотОбъект);
	ПередаваемыеПараметры = Новый Структура("Ключ", Действие);
	ОткрытьФорму("Документ." + ИмяДокумента + ".ФормаОбъекта", ПередаваемыеПараметры, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРезультат() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ra_RezultatyDejstvijPoZayavkeNaOSСрезПоследних.Dejstvie КАК Dejstvie,
	               |	ra_RezultatyDejstvijPoZayavkeNaOSСрезПоследних.Rezultat КАК Rezultat
	               |ИЗ
	               |	РегистрСведений.ra_RezultatyDejstvijPoZayavkeNaOS.СрезПоследних КАК ra_RezultatyDejstvijPoZayavkeNaOSСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ra_RezultatyDejstvijPoZayavkeNaOSСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РезультатДействие = Выборка.Dejstvie;
		РезультатОписание = Выборка.Rezultat;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПродукциюПоКодуОКПД2(OKPD2)
	
	Ссылка = Справочники.ra_MTRiO.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ra_MTRiO.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ra_MTRiO КАК ra_MTRiO
	               |ГДЕ
	               |	ra_MTRiO.OKPD2 = &OKPD2";
	
	Запрос.УстановитьПараметр("OKPD2", OKPD2);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ссылка = Выборка.Ссылка;
	КонецЦикла;

	Возврат Ссылка;
	
КонецФункции

#КонецОбласти
